SiyuChen1/stm32_projects/resource/X-CUBE-53L9A1/STM32CubeExpansion_53L9A1_V1.0.0/Projects/NUCLEO-H563ZI/Applications/53L9A1/53L9A1_PostprocessSingle/Src/vl53l9_app.c
/**
 ******************************************************************************
 * @file    vl53l9_app.c
 * @author  IMD Software Team
 ******************************************************************************
 * @attention
 *
 * Copyright (c) 2026 STMicroelectronics.
 * All rights reserved.
 *
 * This software is licensed under terms that can be found in the LICENSE file
 * in the root directory of this software component.
 * If no LICENSE file comes with this software, it is provided AS-IS.
 *
 ******************************************************************************
 */

#include <stdbool.h>
#include <stddef.h>
#include <stdio.h>
#include <stdlib.h>
#include <string.h>

#include "vl53l9.h"
#include "vl53l9_device.h"
#include "vl53l9_interface.h"
#include "vl53l9_transform.h"
#include "vl53l9_utils.h"

/* USER CODE BEGIN Includes */
#include "stm32h5xx_nucleo.h" /* hcom_uart[], COM1, HAL_UART_Transmit - used to stream binary frames to the PC */
#include "main.h" /* SPI4_NSS_Pin/XIAO_READY_Pin etc. - used to stream binary frames to a XIAO over SPI4 */

extern SPI_HandleTypeDef hspi4; /* defined in main.c, initialized by MX_SPI4_Init() */
/* USER CODE END Includes */

/* application customization */
#define CONF_DEVICE_ID   (0) /**< select device entry in platform descriptor array (see vl53l9_device.c) */
#define CONF_PRINT_FRAME (0) /**< enable printing depth frames as ascii art (slows performance) */
#define CONF_USECASE     (VL53L9_USECASE_AR_PRECISION) /**< select ranging profile to be applied (see vl53l9_utils.h) */

/**
 * @brief Enable streaming amplitude+depth frames to the PC as a binary packet over the COM1 UART.
 * Pair with Utilities/vl53l9_visualizer.py on the host.
 *
 * TURNED OFF for throughput. Measured cost: 83ms of a 210ms frame (40%) - 22692 bytes at 3Mbaud is
 * 75.6ms of pure line time plus per-call overhead, and it is a blocking transmit, so it is pure
 * added latency on every frame. The XIAO/WiFi path now carries the same data. Set back to 1 if you
 * need the tethered PC visualizer again, accepting ~5fps. Requires BspCOMInit.BaudRate in main.c
 * to be raised (see comment there) since 115200 bps is far too slow for image-sized payloads.
 */
#define CONF_STREAM_VISUALIZER (0)

/**
 * @brief Enable bridging the same amplitude+depth+ambient frame to a XIAO ESP32 over SPI4 (SCK=PE12,
 * MISO=PE13, MOSI=PE14, software NSS=PE11, XIAO_READY handshake input=PE9), for the XIAO to re-serve
 * as a live webpage over WiFi instead of requiring a PC tethered to the STM32's UART. Independent of
 * CONF_STREAM_VISUALIZER - either or both can be on. See stm32_utility/spi/spi.ino in the separate
 * Arduino repo for the receiving side and the full wire/handshake protocol writeup.
 */
#define CONF_STREAM_SPI (1)

/**
 * @brief Max consecutive retries for one frame's trigger/wait/read sequence before giving up and
 * calling handle_error(). Observed on hardware: this sequence intermittently fails in different ways
 * (stale interrupt flag, IRQ wait timeout, sensor-reported transient fault) on different runs - a
 * transient timing hiccup, not a persistent fault - so it's worth a few retries before treating it as
 * fatal. Worst case adds up to ACQUIRE_MAX_RETRIES seconds of latency to a single frame (each failed
 * attempt can wait up to the 1000ms IRQ timeout).
 */
#define ACQUIRE_MAX_RETRIES (5)

/**
 * @brief Print a per-stage timing breakdown of the acquisition loop once per second.
 *
 * The XIAO receives every frame this board produces with zero errors, so the frame rate is set
 * entirely here, not by the SPI link. Measured 4.7fps = ~213ms/frame, of which UART (75.6ms at
 * 3Mbaud) and SPI (50.3ms at 3.9MHz) only account for ~126ms - so something else owns the other
 * ~87ms. Rather than guess which stage, time them all. Turn off once the pipeline is tuned.
 */
#define CONF_PROFILE_TIMING (1)

#define MAX(x, y) (((x) > (y)) ? (x) : (y))
#define MIN(x, y) (((x) < (y)) ? (x) : (y))

/**
 * @brief Wire format of one visualizer packet, sent as: header, then `width*height` little-endian
 * float32 amplitude samples, then `width*height` little-endian uint16 depth samples (mm, rounded to
 * nearest), then `width*height` little-endian float32 ambient samples.
 *
 * Depth is quantized to uint16 because its real range is known and safe (0-8800mm per
 * MAX_DISTANCE_RANGE/MAX_DISTANCE_PRECISION in the transform library, plus a 12000mm "invalid pixel"
 * sentinel - see distance_check in vl53l9_transform.c - all comfortably under 65535). Amplitude and
 * ambient are the library's raw "signal_rate"/"ambient_rate" photon-count-rate values, whose true
 * dynamic range isn't documented/bounded the same way - quantizing those to uint16 was tried and
 * visibly clipped/saturated real texture (confirmed on hardware), so they're sent as float32 to stay
 * lossless. Kept in sync with the HEADER_FMT/parsing logic in Utilities/vl53l9_visualizer.py.
 */
typedef struct __attribute__((packed)) {
    uint8_t magic[4];    /**< 'V','L','5','9' - lets the host resynchronize on the byte stream */
    uint32_t frame_counter;
    uint8_t width;
    uint8_t height;
    uint16_t crc16;       /**< CRC-16/CCITT (poly 0x1021, init 0x0000) over the amplitude+depth+ambient payload */
} vis_frame_header_t;

/**
 * @brief Max resolution across all binning values this sensor supports (see the resolution LUT in
 * vl53l9_utils.c - the largest entry is 54x42 for binning=2). Sizes the quantization scratch buffers
 * in send_vis_frame() regardless of which CONF_USECASE profile is selected above.
 */
#define VIS_MAX_PLANE_PIXELS (54U * 42U)

static void print_frame(float *p_frame, size_t height, size_t width);
static memory_t allocate_memory(uint16_t size);
static void handle_error_impl(int line);
/**
 * @brief handle_error() used to spin forever with zero UART output, which made every failure
 * indistinguishable from a hang. This macro captures the call site's line number so the printout
 * below tells you exactly which check tripped - grep vl53l9_app.c for that line number.
 */
#define handle_error() handle_error_impl(__LINE__)
#if CONF_STREAM_VISUALIZER || CONF_STREAM_SPI
/**
 * @brief Shared by both the UART (send_vis_frame) and SPI (send_vis_frame_spi) transports below, so
 * there's exactly one CRC implementation to keep in sync with the receiving ends - not two copies
 * that could silently drift apart. Declared/defined under this combined guard so it's still available
 * if CONF_STREAM_VISUALIZER is ever turned off while CONF_STREAM_SPI stays on (or vice versa).
 */
static uint16_t crc16_ccitt(const uint8_t *data, size_t len, uint16_t crc);
#endif
#if CONF_STREAM_VISUALIZER
static void send_vis_frame(uint32_t frame_counter, uint8_t width, uint8_t height, const float *amplitude,
                            const float *depth, const float *ambient);
#endif
#if CONF_STREAM_SPI
/**
 * @brief SPI has no built-in framing, so every transaction is this fixed length regardless of the
 * frame's actual width*height (see the handshake/padding note in send_vis_frame_spi()). Matches
 * SPI_FRAME_BYTES in the XIAO's spi.ino exactly - 12 (header) + 2268 * (4+2+4) = 22692 bytes.
 */
#define SPI_FRAME_BYTES (sizeof(vis_frame_header_t) + VIS_MAX_PLANE_PIXELS * (sizeof(float) + sizeof(uint16_t) + sizeof(float)))
/* A frame goes out as SPI_CHUNK_COUNT separate transactions, each its own CS assert + READY
 * handshake, rather than one 22692-byte transfer. Espressif's SPI slave docs note the receiver
 * "cannot recognize or receive data correctly if the clock is too fast", and that hosts should
 * write lengths that are multiples of 4 bytes. Empirically a single full-frame transaction died
 * ~4000 bits in, at bit counts that were NOT multiples of 8 - a master cannot clock a partial
 * byte, so the slave was dropping SCK edges and losing sync mid-transaction. Chunking gives it a
 * clean CS resync point 12x per frame and lets the receiver verify each piece independently.
 * Must match SPI_CHUNK_BYTES in the XIAO's spi.ino exactly - wire-protocol constant, so both
 * sides must be reflashed together when it changes. */
/* DIAGNOSTIC MODE. Set to 1 to send a known byte ramp instead of real sensor data: every chunk is
 * filled so that byte k of the whole padded frame == (k & 0xFF). The XIAO has a matching flag and
 * checks each received chunk against that ramp, reporting the first mismatching offset. This takes
 * frame layout, CRC and chunk assembly entirely out of the picture so the raw link can be measured
 * on its own - specifically it distinguishes "no data at all" from "data arrives but shifted by N
 * bytes" (which means the slave armed mid-transfer) from "data arrives but corrupted" (electrical
 * or SPI mode). Set back to 0 once the link is proven. Must match SPI_TEST_PATTERN in spi.ino. */
/* RAW LINK TEST. Set to 1 to bypass SPI entirely and drive SCK/MOSI/NSS as plain GPIO outputs at
 * three different slow rates, so the XIAO (matching flag in spi.ino) can count transitions on each
 * wire independently of any SPI configuration on either side.
 *
 * Why this exists: with a 64-byte transfer at 976kHz the master reports every frame sent OK and the
 * handshake never errors, yet the slave counts ZERO clock edges - even during all-FF, where MOSI is
 * held high the whole transfer. CS demonstrably works (transactions start and end, and the READY
 * edge handshake succeeds 37/37), so the slave is seeing CS but not SCK. Everything checkable in
 * software on the STM32 side has been verified against primary sources, so the next thing to
 * measure is the wires themselves - one at a time, at a speed where nothing subtle can matter.
 *
 * NSS/CS is the built-in control: we already know that path works, so if the XIAO counts NSS
 * transitions but not SCK transitions, that is a measured per-wire result with a working reference,
 * not a guess. Set back to 0 to resume normal operation. */
#define SPI_LINK_GPIO_TEST (0)

#define SPI_TEST_PATTERN (0)
/* In test mode, shrink the problem to the smallest thing that could possibly work: ONE transaction
 * of SPI_TEST_BYTES per frame, at the slowest clock the prescaler offers (/256, ~976kHz - see
 * MX_SPI4_Init). Everything on the STM32 side has been verified correct against primary sources
 * (pin + AF5 against ST's CubeMX database, the clock chain against SystemClock_Config and the CMSIS
 * headers, HAL_SPI_Transmit against the HAL source), and the master reports all chunks sent, yet
 * the slave still captures ~25% of the bits with a beating/aliased pattern. So rather than keep
 * inspecting a 2048-byte 12-chunk transfer, bisect: if 64 bytes at 976kHz arrives perfectly, the
 * link is sound and the fault is size/timing dependent, and the size can be walked back up to find
 * the breaking point. If even this fails, the fault is fundamental and independent of both. */
#define SPI_TEST_BYTES (64)
#define SPI_CHUNK_BYTES (2048)
#define SPI_CHUNK_COUNT ((SPI_FRAME_BYTES + SPI_CHUNK_BYTES - 1) / SPI_CHUNK_BYTES) /* 12 */
#define SPI_PADDED_FRAME_BYTES (SPI_CHUNK_COUNT * SPI_CHUNK_BYTES)                  /* 24576 */
#define SPI_READY_TIMEOUT_MS (200)   /**< how long to wait for the XIAO's READY handshake before skipping this frame */
/* ~92.9ms of actual transfer at the current 1.95MHz (SPI_BAUDRATEPRESCALER_128) SCK - was 100ms
 * (a ~7% margin, not "generous") until this got caught: I dropped the clock 8x when testing a
 * crosstalk hypothesis but forgot this constant assumed the old 15.625MHz timing. 500ms gives
 * real headroom against interrupt latency (I3C/TIM3/USB) stretching the transfer. Re-check this
 * value again if the clock is ever raised back toward /16. */
#define SPI_TRANSFER_TIMEOUT_MS (500)
/* Guard delays around the SPI handshake - see the long comment in send_vis_frame_spi(). These
 * cover the gap between the XIAO's spi_slave_queue_trans() returning (which is when it raises
 * READY) and its SPI slave hardware actually being armed by the driver's own ISR/task context.
 * 200us is deliberately generous: at 4fps this costs 0.08% of the frame budget, so there is no
 * reason to trim it close. Only worth revisiting if the frame rate ever climbs high enough that
 * a fifth of a millisecond per frame actually matters. */
#define SPI_READY_TO_CS_DELAY_US (200)
#define SPI_CS_SETUP_DELAY_US (10)
#define SPI_CS_HOLD_DELAY_US (10)

/**
 * @brief Busy-wait for approximately @p us microseconds.
 *
 * HAL_Delay()'s 1ms granularity is far too coarse for the sub-millisecond guard delays the SPI
 * handshake needs, and its tick-phase rounding means HAL_Delay(1) can return almost immediately.
 * This is only ever called with small values around a single SPI transaction, so a NOP loop is
 * simpler than standing up DWT's cycle counter. `volatile` is what keeps -Ofast (this project's
 * optimization level) from deleting the loop outright as having no observable effect.
 */
#if SPI_LINK_GPIO_TEST
/**
 * @brief Drive SCK/MOSI/NSS as plain GPIO outputs at three distinct rates, forever. Never returns.
 *
 * Each wire gets its own toggle rate so the receiving side can tell them apart by transition count
 * alone, with no shared clock, no framing and no SPI peripheral involved on either end:
 *   SCK  (PE12) toggles every  50ms -> ~20 transitions/sec
 *   MOSI (PE14) toggles every 100ms -> ~10 transitions/sec
 *   NSS  (PE11) toggles every 200ms -> ~5  transitions/sec
 */
static void spi_link_gpio_test(void) {
    GPIO_InitTypeDef gpio = {0};
    __HAL_RCC_GPIOE_CLK_ENABLE();

    /* Take SCK and MOSI back from SPI4's alternate function - MX_SPI4_Init/HAL_SPI_MspInit set them
     * to AF5 at startup, and this test needs them as plain outputs. NSS is already a plain output. */
    gpio.Pin = GPIO_PIN_12 | GPIO_PIN_14 | SPI4_NSS_Pin;
    gpio.Mode = GPIO_MODE_OUTPUT_PP;
    gpio.Pull = GPIO_NOPULL;
    gpio.Speed = GPIO_SPEED_FREQ_VERY_HIGH;
    HAL_GPIO_Init(GPIOE, &gpio);

    printf("SPI_LINK_GPIO_TEST: driving SCK(PE12)=20 transitions/s, MOSI(PE14)=10/s, NSS(PE11)=5/s\n");
    printf("SPI_LINK_GPIO_TEST: SPI is NOT running in this mode - this measures the wires only.\n");

    uint32_t last_report = HAL_GetTick();
    while (1) {
        uint32_t t = HAL_GetTick();
        HAL_GPIO_WritePin(GPIOE, GPIO_PIN_12, ((t / 50U) & 1U) ? GPIO_PIN_SET : GPIO_PIN_RESET);
        HAL_GPIO_WritePin(GPIOE, GPIO_PIN_14, ((t / 100U) & 1U) ? GPIO_PIN_SET : GPIO_PIN_RESET);
        HAL_GPIO_WritePin(GPIOE, SPI4_NSS_Pin, ((t / 200U) & 1U) ? GPIO_PIN_SET : GPIO_PIN_RESET);

        if ((t - last_report) >= 1000U) {
            last_report = t;
            printf("SPI_LINK_GPIO_TEST: still driving (t=%lums) READY(PE9) reads %d\n", (unsigned long)t,
                   (int)HAL_GPIO_ReadPin(XIAO_READY_GPIO_Port, XIAO_READY_Pin));
        }
    }
}
#endif /* SPI_LINK_GPIO_TEST */

static void spi_bridge_delay_us(uint32_t us) {
    /* ~4 core cycles per iteration of this loop; SystemCoreClock is 250MHz on this board. */
    volatile uint32_t cycles = (SystemCoreClock / 1000000UL) * us / 4UL;
    while (cycles-- > 0UL) {
        __NOP();
    }
}

/**
 * @brief Block until the XIAO's READY line reaches @p level, or SPI_READY_TIMEOUT_MS elapses.
 * @return true if the level was reached, false on timeout.
 *
 * The handshake is edge-based, not level-based, and that distinction is the whole point: after a
 * chunk is clocked out, READY is still HIGH from that same chunk until the XIAO's ISR drops it. A
 * master that only waits for "READY == HIGH" would read that stale HIGH as "armed for the next
 * chunk" and start clocking into an unarmed slave. So between chunks we wait for LOW (the slave
 * acknowledged the previous transaction ended) and only then for HIGH (it has re-armed).
 */
static bool spi_wait_ready(GPIO_PinState level) {
    uint32_t wait_start = HAL_GetTick();
    while (HAL_GPIO_ReadPin(XIAO_READY_GPIO_Port, XIAO_READY_Pin) != level) {
        if ((HAL_GetTick() - wait_start) > SPI_READY_TIMEOUT_MS) {
            return false;
        }
    }
    return true;
}

static void send_vis_frame_spi(uint32_t frame_counter, uint8_t width, uint8_t height, const float *amplitude,
                                const float *depth, const float *ambient);
#endif

void vl53l9_app() {

#if CONF_STREAM_SPI && SPI_LINK_GPIO_TEST
    /* Raw wire measurement mode - never returns. Runs before the sensor is touched so nothing else
     * can interfere with, or be blamed for, what the pins are doing. */
    spi_link_gpio_test();
#endif

    /* checkpoint prints: pinpoint exactly how far setup gets before a silent hang/crash */
    printf("vl53l9_app: starting (CONF_STREAM_VISUALIZER=%d)\n", CONF_STREAM_VISUALIZER);

