SiyuChen1/stm32_projects/resource/X-CUBE-53L9A1/STM32CubeExpansion_53L9A1_V1.0.0/Projects/NUCLEO-H563ZI/Applications/53L9A1/53L9A1_PostprocessSingle/Src/vl53l9_app.c
    int ret;
    transform_t *p_transform = vl53l9_transform_create();
    vl53l9_device_t *p_dev = &device[CONF_DEVICE_ID];
    vl53l9_profile_t *p_profile = &g_ranging_profiles[CONF_USECASE];

    uint16_t raw_buffer_size = 0, frame_buffer_size = 0; /* bytes */
    uint32_t in_width = 0, in_height = 0;                /* pixels */
    uint8_t out_width = 0, out_height = 0;               /* pixels */
    vl53l9_get_raw_buffer_size(p_profile->binning, &raw_buffer_size);
    vl53l9_utils_get_resolution(p_profile->binning, &out_width, &out_height);
    frame_buffer_size = out_width * out_height * sizeof(float);

    if (p_profile->binning == 2) {
        in_width = 14842;
        in_height = 1;
    } else if (p_profile->binning == 4) {
        in_width = 3844;
        in_height = 1;
    } else {
        handle_error(); /* unsupported binning */
    }

    /* sensor reset */
    platform_power_reset(CONF_DEVICE_ID);
    if (p_dev->bus_type & PLATFORM_BUS_I3C) {
        platform_assign_dynamic_address();
    }

    /* initialize sensor and retrieve calibration data */
    ret = vl53l9_init(p_dev);
    if (ret) {
        handle_error();
    }
    printf("vl53l9_app: vl53l9_init OK\n");

    uint8_t calib_data[VL53L9_CALIB_DATA_SIZE];
    ret = vl53l9_get_calib_data(p_dev, calib_data);
    if (ret) {
        handle_error();
    }
    printf("vl53l9_app: calibration data OK\n");

    vl53l9_utils_set_profile(p_dev, p_profile);

    /* initialize processing pipeline */
    ret = transform_initialize(p_transform);
    if (ret) {
        handle_error();
    }
    printf("vl53l9_app: transform_initialize OK\n");

    /* inspect available streams and controls */
    const streams_t *stream_list;
    transform_get_streams(p_transform, &stream_list);
    streams_inspect(stream_list, printf);

    const controls_t *control_list;
    transform_get_controls(p_transform, &control_list);
    controls_inspect(control_list, printf);

    /* set capabilities */

    /**
     * NOTE:
     * setting capabilities is a mandatory step:
     *  - at least one input and one output stream must be set
     *  - input stream must be configured before output ones
     *  - there are no default capabilities, they must be explicitly set
     */

    /* build raw stream capabilities */
    property_t raw_format = { "format", { .val.v_string = "3DMD", .tid = VTID_STRING } };
    property_t raw_width = { "width", { .val.v_uint32 = in_width, .tid = VTID_UINT32 } };
    property_t raw_height = { "height", { .val.v_uint32 = in_height, .tid = VTID_UINT32 } };

    properties_t *raw_props = properties_new(3); /* format, width, height */
    properties_add(raw_props, &raw_format);
    properties_add(raw_props, &raw_width);
    properties_add(raw_props, &raw_height);
    capabilities_t *raw_caps = capabilities_new_simple(&raw_props);

    /* build depth stream capabilities */
    property_t depth_format = { "format", { .val.v_string = "ZF32", .tid = VTID_STRING } };
    property_t depth_width = { "width", { .val.v_uint32 = out_width, .tid = VTID_UINT32 } };
    property_t depth_height = { "height", { .val.v_uint32 = out_height, .tid = VTID_UINT32 } };

    properties_t *depth_props = properties_new(3); /* format, width, height */
    properties_add(depth_props, &depth_format);
    properties_add(depth_props, &depth_width);
    properties_add(depth_props, &depth_height);
    capabilities_t *depth_caps = capabilities_new_simple(&depth_props);

#if CONF_STREAM_VISUALIZER || CONF_STREAM_SPI
    /* build amplitude stream capabilities (same resolution as depth, used as the "image" for the PC visualizer) */
    property_t amp_format = { "format", { .val.v_string = "AF32", .tid = VTID_STRING } };
    property_t amp_width = { "width", { .val.v_uint32 = out_width, .tid = VTID_UINT32 } };
    property_t amp_height = { "height", { .val.v_uint32 = out_height, .tid = VTID_UINT32 } };

    properties_t *amp_props = properties_new(3); /* format, width, height */
    properties_add(amp_props, &amp_format);
    properties_add(amp_props, &amp_width);
    properties_add(amp_props, &amp_height);
    capabilities_t *amp_caps = capabilities_new_simple(&amp_props);

    /* build ambient stream capabilities (same resolution as depth - background/environmental IR light
     * per zone, independent of the sensor's own laser; distinct from amplitude, see chat explanation) */
    property_t ambient_format = { "format", { .val.v_string = "IF32", .tid = VTID_STRING } };
    property_t ambient_width = { "width", { .val.v_uint32 = out_width, .tid = VTID_UINT32 } };
    property_t ambient_height = { "height", { .val.v_uint32 = out_height, .tid = VTID_UINT32 } };

    properties_t *ambient_props = properties_new(3); /* format, width, height */
    properties_add(ambient_props, &ambient_format);
    properties_add(ambient_props, &ambient_width);
    properties_add(ambient_props, &ambient_height);
    capabilities_t *ambient_caps = capabilities_new_simple(&ambient_props);
#endif

    /* set stream capabilities */
    ret = transform_set_stream_capabilities(p_transform, "raw", raw_caps);
    if (ret) {
        handle_error();
    }

    ret = transform_set_stream_capabilities(p_transform, "depth", depth_caps);
    if (ret) {
        handle_error();
    }

#if CONF_STREAM_VISUALIZER || CONF_STREAM_SPI
    ret = transform_set_stream_capabilities(p_transform, "amplitude", amp_caps);
    if (ret) {
        handle_error();
    }

    ret = transform_set_stream_capabilities(p_transform, "ambient", ambient_caps);
    if (ret) {
        handle_error();
    }
#endif

    /* free properties and capabilities (TODO: improve using free functions) */
    properties_free(raw_props, NULL);
    properties_free(depth_props, NULL);
    capabilities_free(raw_caps, NULL);
    capabilities_free(depth_caps, NULL);
#if CONF_STREAM_VISUALIZER || CONF_STREAM_SPI
    properties_free(amp_props, NULL);
    capabilities_free(amp_caps, NULL);
    properties_free(ambient_props, NULL);
    capabilities_free(ambient_caps, NULL);
#endif
    printf("vl53l9_app: stream capabilities set OK\n");

    /* set controls */

    /* NOTE: the following control is mandatory and must be set before calling prepare() */
    ret = transform_set_control(p_transform, "calib-buffer", (value_t){ .val.v_ptr = calib_data, .tid = VTID_POINTER });
    if (ret) {
        handle_error();
    }

    /* check pipeline configuration and compute internal parameters required for processing */
    ret = transform_prepare(p_transform);
    if (ret) {
        handle_error();
    }
    printf("vl53l9_app: transform_prepare OK\n");

