SiyuChen1/stm32_projects/resource/X-CUBE-53L9A1/STM32CubeExpansion_53L9A1_V1.0.0/Projects/NUCLEO-H563ZI/Applications/53L9A1/53L9A1_PostprocessSingle/Src/vl53l9_app.c
    /* allocate memory and initialize buffers (raw data is double buffered) */
    uint8_t raw_mem_index = 0;
    memory_t in_raw_mem[2] = { allocate_memory(raw_buffer_size), allocate_memory(raw_buffer_size) };
    memory_t out_depth_mem = allocate_memory(frame_buffer_size);

    memories_t in_raw_mems = { .items = &in_raw_mem, .size = 1, .capacity = 1, .item_size = sizeof(memory_t) };
    memories_t out_depth_mems = { .items = &out_depth_mem, .size = 1, .capacity = 1, .item_size = sizeof(memory_t) };

    stream_buffer_t in_raw_stream_buffer = { .name = "raw", .buffer = { .memories = &in_raw_mems, .nb = 1 } };
    stream_buffer_t out_depth_stream_buffer = { .name = "depth", .buffer = { .memories = &out_depth_mems, .nb = 1 } };

#if CONF_STREAM_VISUALIZER || CONF_STREAM_SPI
    /* amplitude/ambient outputs, same resolution/size as depth (AF32/IF32 are float32 like ZF32) */
    memory_t out_amp_mem = allocate_memory(frame_buffer_size);
    memories_t out_amp_mems = { .items = &out_amp_mem, .size = 1, .capacity = 1, .item_size = sizeof(memory_t) };
    stream_buffer_t out_amp_stream_buffer = { .name = "amplitude", .buffer = { .memories = &out_amp_mems, .nb = 1 } };

    memory_t out_ambient_mem = allocate_memory(frame_buffer_size);
    memories_t out_ambient_mems = { .items = &out_ambient_mem, .size = 1, .capacity = 1, .item_size = sizeof(memory_t) };
    stream_buffer_t out_ambient_stream_buffer = { .name = "ambient",
                                                  .buffer = { .memories = &out_ambient_mems, .nb = 1 } };
#endif

    /* build stream buffers container */
    stream_buffers_t stream_buffers = { .items =
                                            (stream_buffer_t[]){
                                                in_raw_stream_buffer,
                                                out_depth_stream_buffer,
#if CONF_STREAM_VISUALIZER || CONF_STREAM_SPI
                                                out_amp_stream_buffer,
                                                out_ambient_stream_buffer,
#endif
                                            },
#if CONF_STREAM_VISUALIZER || CONF_STREAM_SPI
                                        .size = 4,
                                        .capacity = 4,
#else
                                        .size = 2,
                                        .capacity = 2,
#endif
                                        .item_size = sizeof(stream_buffer_t) };

    ret = vl53l9_set_sync_mode(p_dev, VL53L9_SYNC_MANUAL);
    if (ret) {
        handle_error();
    }

    ret = vl53l9_start(p_dev);
    if (ret) {
        handle_error();
    }

    /* BUGFIX: EXTI7 (the sensor's INTR pin) is enabled way back in main.c's MX_GPIO_Init(), before
     * vl53l9_app() even runs, so any falling edge during the reset/init/calib/prepare/start sequence
     * above (unrelated to an actual "frame ready" condition) can latch PLATFORM_GPIO_IT_EVT in the
     * platform layer's sticky g_platform_evt flag - nothing before this point ever clears it. Flush it
     * here so the first acquisition attempt below starts clean (each retry attempt also re-flushes it,
     * see ACQUIRE_MAX_RETRIES below). Pre-existing gap in the unmodified ST example, not introduced for
     * the visualizer streaming. */
    platform_acknowledge_event(PLATFORM_GPIO_IT_EVT);

    printf("vl53l9_app: buffers allocated, vl53l9_start OK, entering main loop\n");

    platform_profiler_enable();
    uint32_t start_time = platform_profiler_get_timestamp();
    uint32_t stop_time;
    float frame_rate;

    bool is_first_frame = true;
    bool depth_ready = false; /* out_depth_mem/out_amp_mem only hold valid data once processed once */

    while (1) {

        /* BUGFIX: acquiring one raw frame (trigger -> wait for IRQ -> read) has been observed to fail
         * intermittently in three different ways across repeated runs on this board: a stale/leftover
         * interrupt flag, a full 1000ms timeout with no interrupt at all, and a sensor-reported
         * transient fault (status.error bit sof_outside_blanking). Different failure point every time
         * is the signature of a real transient timing hiccup, not a single deterministic bug - so
         * instead of killing the whole application on the first one (the original ST example's
         * behavior), retry the whole trigger/wait/read sequence a bounded number of times. This also
         * subsumes the vl53l9_trigger_frame() discarded-return-value bug from the unmodified example
         * (its result is now checked, as part of this retry loop). */
#if CONF_PROFILE_TIMING
        uint32_t t_loop_start = platform_profiler_get_timestamp();
#endif
        int acquire_attempt;
        for (acquire_attempt = 0; acquire_attempt < ACQUIRE_MAX_RETRIES; acquire_attempt++) {
            platform_acknowledge_event(PLATFORM_GPIO_IT_EVT); /* flush any stale flag before this attempt */

            ret = vl53l9_trigger_frame(p_dev);
            if (ret) {
                printf("vl53l9_app: trigger_frame failed (ret=%d), retrying (%d/%d)\n", ret, acquire_attempt + 1,
                       ACQUIRE_MAX_RETRIES);
                continue;
            }

            ret = platform_wait_for_event(PLATFORM_GPIO_IT_EVT, 1000);
            if (ret) {
                printf("vl53l9_app: wait for frame IRQ timed out, retrying (%d/%d)\n", acquire_attempt + 1,
                       ACQUIRE_MAX_RETRIES);
                continue;
            }

            platform_acknowledge_event(PLATFORM_GPIO_IT_EVT);

            /* grab raw data from sensor and fill input buffer */
            ret = vl53l9_get_frame_async(p_dev, in_raw_mem[raw_mem_index].data, in_raw_mem[raw_mem_index].size);
            if (ret == 0) {
                break; /* got a frame - proceed */
            }
            printf("vl53l9_app: get_frame_async failed (ret=%d), retrying (%d/%d)\n", ret, acquire_attempt + 1,
                   ACQUIRE_MAX_RETRIES);
        }
        if (acquire_attempt == ACQUIRE_MAX_RETRIES) {
            printf("vl53l9_app: giving up after %d consecutive failed acquisition attempts\n", ACQUIRE_MAX_RETRIES);
            handle_error();
        }

#if CONF_PROFILE_TIMING
        uint32_t t_after_acquire = platform_profiler_get_timestamp();
#endif
        /* process the previous frame while the sensor is acquiring the next one */
        if (is_first_frame) {
            is_first_frame = false;
        } else {
            /* TODO: find a better way to handle this, maybe leveraging mems list */
            in_raw_mems.items = &in_raw_mem[(raw_mem_index + 1) % 2];
            ret = transform_process_stream(p_transform, &stream_buffers);
            if (ret) {
                handle_error();
            }
            depth_ready = true;
        }

#if CONF_PROFILE_TIMING
        uint32_t t_after_transform = platform_profiler_get_timestamp();
#endif
        ret = platform_wait_for_event(PLATFORM_I3C_DMA_RX_EVT, 1000);
        if (ret) {
            handle_error();
        }
        platform_acknowledge_event(PLATFORM_I3C_DMA_RX_EVT);

        ret = vl53l9_get_frame_async_ack(p_dev, in_raw_mem[raw_mem_index].data, in_raw_mem[raw_mem_index].size);
        if (ret) {
            handle_error();
        }

        /* TODO: to be moved below but avoid printing for first frame */
        vl53l9_frame_t frame = { 0 };
        ret = vl53l9_utils_parse_frame(in_raw_mem[raw_mem_index].data, in_raw_mem[raw_mem_index].size, &frame);
        if (ret) {
            handle_error();
        }

#if CONF_PROFILE_TIMING
        uint32_t t_after_readout = platform_profiler_get_timestamp();
#endif
        /* measure frame rate */
        stop_time = platform_profiler_get_timestamp();
        frame_rate = (1.0f / (float)(platform_profiler_convert_to_us(stop_time - start_time))) * 1000000;
        start_time = stop_time;

        if (depth_ready) {
            print_frame((float *)out_depth_mem.data, out_height, out_width);
            printf("Processed frame n. %lu @ %u fps\n", (unsigned long)frame.p_metadata->frame_counter,
                   (unsigned int)frame_rate);
#if CONF_PROFILE_TIMING
            uint32_t t_before_uart = platform_profiler_get_timestamp();
#endif
#if CONF_STREAM_VISUALIZER
            send_vis_frame(frame.p_metadata->frame_counter, out_width, out_height, (const float *)out_amp_mem.data,
                            (const float *)out_depth_mem.data, (const float *)out_ambient_mem.data);
#endif
#if CONF_PROFILE_TIMING
            uint32_t t_after_uart = platform_profiler_get_timestamp();
#endif
#if CONF_STREAM_SPI
            send_vis_frame_spi(frame.p_metadata->frame_counter, out_width, out_height, (const float *)out_amp_mem.data,
                                (const float *)out_depth_mem.data, (const float *)out_ambient_mem.data);
#endif
#if CONF_PROFILE_TIMING
            {
                /* Rate-limited to one line per second: the point is the steady-state split between
                 * stages, not every frame. All values in milliseconds. "print" is the ascii-art +
                 * "Processed frame" printf above, which also goes out over the same 3Mbaud UART. */
                static uint32_t last_profile_ms = 0;
                uint32_t now_ms = HAL_GetTick();
                if ((now_ms - last_profile_ms) >= 1000U) {
                    uint32_t t_end = platform_profiler_get_timestamp();
                    last_profile_ms = now_ms;
                    printf("PROFILE ms: acquire=%lu transform=%lu readout=%lu print=%lu uart=%lu spi=%lu | total=%lu\n",
                           (unsigned long)(platform_profiler_convert_to_us(t_after_acquire - t_loop_start) / 1000U),
                           (unsigned long)(platform_profiler_convert_to_us(t_after_transform - t_after_acquire) / 1000U),
                           (unsigned long)(platform_profiler_convert_to_us(t_after_readout - t_after_transform) / 1000U),
                           (unsigned long)(platform_profiler_convert_to_us(t_before_uart - t_after_readout) / 1000U),
                           (unsigned long)(platform_profiler_convert_to_us(t_after_uart - t_before_uart) / 1000U),
                           (unsigned long)(platform_profiler_convert_to_us(t_end - t_after_uart) / 1000U),
                           (unsigned long)(platform_profiler_convert_to_us(t_end - t_loop_start) / 1000U));
                }
            }
#endif
        }

        /* swap raw buffer index for next frame acquisition */
        raw_mem_index = (raw_mem_index + 1) % 2;
    }

    /* NOTE: free memory and pipeline resources to avoid leaks */
    /* free(in_raw_mem[0].data); */
    /* free(in_raw_mem[1].data); */
    /* free(out_depth_mem.data); */
    /* transform_finalize(p_transform); */
    /* transform_release(p_transform); */
    /* vl53l9_transform_destroy(p_transform); */
}

static void print_frame(float *p_frame, size_t height, size_t width) {
#if CONF_PRINT_FRAME
    static const char ASCII_CHARS[] = "@%#*+=-:. ";

    printf("\033[%d;%dH", 0, 0); /* set cursor to the top of the screen */
    int pixel_step = 1;
    uint32_t min = UINT32_MAX;
    uint32_t max = 0;

    for (uint32_t i = 0; i < (height * width); i++) {
        uint32_t value = (uint32_t)p_frame[i];
        min = MIN(value, min);
        max = MAX(value, max);
    }

    uint32_t average = (uint32_t)((max - min) * 0.05f);
    min = MAX(min - average, 0);
    max = MIN(max + average, UINT32_MAX);

    for (uint32_t y = 0; y < height; y += pixel_step) {
        for (uint32_t x = 0; x < width; x += pixel_step) {
            uint32_t pixel_index = (y * width + x);
            uint32_t value = (uint32_t)p_frame[pixel_index];

            uint32_t ascii_index = (value - min) * (sizeof(ASCII_CHARS) - 1) / (max - min);
            ascii_index = MIN(ascii_index, sizeof(ASCII_CHARS) - 1);

            printf("%c", ASCII_CHARS[ascii_index]);
        }
        printf("\n");
    }
#endif /* CONF_PRINT_FRAME */
    return;
}

static memory_t allocate_memory(uint16_t size) {
    memory_t memory;
    memory.size = size;
    memory.data = malloc(size);
    if (memory.data == NULL) {
        handle_error();
    }
    return memory;
}

