SiyuChen1/stm32_projects/resource/X-CUBE-53L9A1/STM32CubeExpansion_53L9A1_V1.0.0/Projects/NUCLEO-H563ZI/Applications/53L9A1/53L9A1_PostprocessSingle/Src/vl53l9_app.c
static void handle_error_impl(int line) {
    vl53l9_status_t status = { 0 };
    int status_ret = vl53l9_get_status(&device[CONF_DEVICE_ID], &status);
    /* NOTE: printf()/HAL_UART_Transmit are blocking, so this is flushed out before we spin forever below,
     * even though the loop that follows never returns. */
    printf("\n*** handle_error() at vl53l9_app.c:%d - vl53l9_get_status() %s "
           "(fsm=0x%02x command=0x%02x firmware_err=0x%04x error=0x%02x) ***\n",
           line, status_ret ? "FAILED (bus/sensor likely unreachable)" : "ok", status.fsm, status.command,
           status.firmware, *(uint8_t *)&status.error);
    while (1)
        ;
}

#if CONF_STREAM_VISUALIZER || CONF_STREAM_SPI
/**
 * @brief CRC-16/CCITT (poly 0x1021, no reflection). Must match the Python-side implementation in
 * Utilities/vl53l9_visualizer.py and the XIAO-side implementation in stm32_utility/spi/spi.ino so
 * every receiving end can validate/resync on the byte stream. Shared by both send_vis_frame() (UART)
 * and send_vis_frame_spi() (SPI) below - see the combined guard note at this function's declaration.
 */
static uint16_t crc16_ccitt(const uint8_t *data, size_t len, uint16_t crc) {
    for (size_t i = 0; i < len; i++) {
        crc ^= (uint16_t)data[i] << 8;
        for (uint8_t bit = 0; bit < 8; bit++) {
            crc = (crc & 0x8000U) ? (uint16_t)((crc << 1) ^ 0x1021U) : (uint16_t)(crc << 1);
        }
    }
    return crc;
}
#endif /* CONF_STREAM_VISUALIZER || CONF_STREAM_SPI */

#if CONF_STREAM_VISUALIZER
/**
 * @brief Send one amplitude+depth+ambient frame to the PC over the COM1 UART as a binary packet, for
 * live visualization by Utilities/vl53l9_visualizer.py. Blocking (uses HAL_UART_Transmit), so this
 * adds latency to the acquisition loop proportional to payload size / baudrate.
 *
 * depth is quantized to uint16 (round-to-nearest, clamped) - its real range (0-8800mm, plus the
 * library's 12000mm invalid-pixel sentinel) is known-safe. amplitude/ambient are sent as the
 * library's native float32 - they are raw photon-count-rate values ("signal_rate"/"ambient_rate")
 * without a documented safe uint16 range; quantizing those was tried and visibly clipped/saturated
 * real texture on hardware, so they stay lossless float32. See the vis_frame_header_t comment above.
 */
static void send_vis_frame(uint32_t frame_counter, uint8_t width, uint8_t height, const float *amplitude,
                            const float *depth, const float *ambient) {
    static uint16_t depth_q[VIS_MAX_PLANE_PIXELS];

    size_t pixels = (size_t)width * height;
    if (pixels > VIS_MAX_PLANE_PIXELS) {
        handle_error(); /* should never happen for a supported binning value, see VIS_MAX_PLANE_PIXELS */
    }

    for (size_t i = 0; i < pixels; i++) {
        depth_q[i] = (uint16_t)MIN(MAX(depth[i] + 0.5f, 0.0f), 65535.0f);
    }

    vis_frame_header_t header;
    memcpy(header.magic, "VL59", sizeof(header.magic));
    header.frame_counter = frame_counter;
    header.width = width;
    header.height = height;

    size_t amp_bytes = pixels * sizeof(float);
    size_t depth_bytes = pixels * sizeof(uint16_t);
    size_t ambient_bytes = pixels * sizeof(float);

    uint16_t crc = crc16_ccitt((const uint8_t *)amplitude, amp_bytes, 0);
    crc = crc16_ccitt((const uint8_t *)depth_q, depth_bytes, crc);
    crc = crc16_ccitt((const uint8_t *)ambient, ambient_bytes, crc);
    header.crc16 = crc;

    if (HAL_UART_Transmit(&hcom_uart[COM1], (uint8_t *)&header, sizeof(header), 1000) != HAL_OK) {
        handle_error();
    }
    if (HAL_UART_Transmit(&hcom_uart[COM1], (uint8_t *)amplitude, (uint16_t)amp_bytes, 1000) != HAL_OK) {
        handle_error();
    }
    if (HAL_UART_Transmit(&hcom_uart[COM1], (uint8_t *)depth_q, (uint16_t)depth_bytes, 1000) != HAL_OK) {
        handle_error();
    }
    if (HAL_UART_Transmit(&hcom_uart[COM1], (uint8_t *)ambient, (uint16_t)ambient_bytes, 1000) != HAL_OK) {
        handle_error();
    }
}
#endif /* CONF_STREAM_VISUALIZER */

#if CONF_STREAM_SPI
/**
 * @brief Send one amplitude+depth+ambient frame to a XIAO ESP32 over SPI4, for the XIAO to re-serve as
 * a live webpage over WiFi (stm32_utility/spi/spi.ino in the separate Arduino repo). Same wire format,
 * same mixed-precision quantization and the same CRC as send_vis_frame() above (see that function's
 * comment for why depth is uint16 but amplitude/ambient stay float32) - only the transport differs.
 *
 * Unlike UART, SPI has no built-in framing: the transfer length must be agreed by both sides ahead of
 * the transaction, and the receiving XIAO can't produce a receive buffer on demand mid-transaction. So
 * the frame is padded out to SPI_PADDED_FRAME_BYTES and sent as SPI_CHUNK_COUNT fixed-size chunks (the
 * receiver only reads width*height pixels per plane from the header, so padding is ignored), each chunk
 * waiting on the XIAO's PIN_READY handshake before asserting the software NSS and clocking it out. If
 * the XIAO never raises READY (not powered, not flashed, not wired, or still processing) the frame is
 * abandoned mid-way rather than blocking the whole acquisition loop; the XIAO resyncs to chunk 0 on its
 * side. Failures here are independent of, and must not affect, the UART path above.
 */
static void send_vis_frame_spi(uint32_t frame_counter, uint8_t width, uint8_t height, const float *amplitude,
                                const float *depth, const float *ambient) {
    static uint8_t tx_buf[SPI_PADDED_FRAME_BYTES];
    static uint16_t depth_q[VIS_MAX_PLANE_PIXELS];

    size_t pixels = (size_t)width * height;
    if (pixels > VIS_MAX_PLANE_PIXELS) {
        handle_error(); /* should never happen for a supported binning value, see VIS_MAX_PLANE_PIXELS */
    }

    for (size_t i = 0; i < pixels; i++) {
        depth_q[i] = (uint16_t)MIN(MAX(depth[i] + 0.5f, 0.0f), 65535.0f);
    }

    vis_frame_header_t header;
    memcpy(header.magic, "VL59", sizeof(header.magic));
    header.frame_counter = frame_counter;
    header.width = width;
    header.height = height;

    size_t amp_bytes = pixels * sizeof(float);
    size_t depth_bytes = pixels * sizeof(uint16_t);
    size_t ambient_bytes = pixels * sizeof(float);
    size_t total = sizeof(header) + amp_bytes + depth_bytes + ambient_bytes;

    uint16_t crc = crc16_ccitt((const uint8_t *)amplitude, amp_bytes, 0);
    crc = crc16_ccitt((const uint8_t *)depth_q, depth_bytes, crc);
    crc = crc16_ccitt((const uint8_t *)ambient, ambient_bytes, crc);
    header.crc16 = crc;

    memcpy(tx_buf, &header, sizeof(header));
    memcpy(tx_buf + sizeof(header), amplitude, amp_bytes);
    memcpy(tx_buf + sizeof(header) + amp_bytes, depth_q, depth_bytes);
    memcpy(tx_buf + sizeof(header) + amp_bytes + depth_bytes, ambient, ambient_bytes);
    /* Pad out to the full chunked length so every transaction is exactly SPI_CHUNK_BYTES - the tail
     * beyond `total` is don't-care, the receiver sizes each plane from the header. */
    if (total < SPI_PADDED_FRAME_BYTES) {
        memset(tx_buf + total, 0, SPI_PADDED_FRAME_BYTES - total);
    }

