SiyuChen1/stm32_projects/resource/X-CUBE-53L9A1/STM32CubeExpansion_53L9A1_V1.0.0/Projects/NUCLEO-H563ZI/Applications/53L9A1/53L9A1_PostprocessSingle/Src/vl53l9_app.c
#if SPI_TEST_PATTERN
    /* Cycle through four diagnostic patterns, switching every 5 seconds so each one spans several
     * of the once-per-second log lines on both sides and the transitions are obvious when the two
     * logs are lined up.
     *
     * The constant patterns are the point. A ramp cannot tell "MOSI carries no real data" apart
     * from "MOSI is fine but sampling timing is wrong" - both look like garbage. A CONSTANT must
     * survive any timing error whatsoever: if the master holds MOSI low for the whole transfer,
     * every sample must read 0x00 no matter when it is taken. So:
     *   all-00 reads 00 AND all-FF reads FF -> the MOSI data path works; the fault is timing/framing
     *   all-FF does not read back as FF     -> MOSI is not carrying the master's data at all
     *   all-AA (01010101) reading as 55/33/0F -> sampling at the wrong rate or edge */
    uint32_t test_phase = (HAL_GetTick() / 5000U) % 4U;
    uint8_t fill = 0x00;
    const char *pattern_name = "ramp";
    switch (test_phase) {
        case 1: fill = 0x00; pattern_name = "all-00"; break;
        case 2: fill = 0xFF; pattern_name = "all-FF"; break;
        case 3: fill = 0xAA; pattern_name = "all-AA"; break;
        default: break;
    }
    for (size_t i = 0; i < SPI_PADDED_FRAME_BYTES; i++) {
        tx_buf[i] = (test_phase == 0U) ? (uint8_t)(i & 0xFF) : fill;
    }

    static uint32_t last_pattern_log_ms = 0;
    uint32_t pattern_now = HAL_GetTick();
    if ((pattern_now - last_pattern_log_ms) >= 1000U) {
        last_pattern_log_ms = pattern_now;
        printf("TESTTX: pattern=%s first16: %02X %02X %02X %02X %02X %02X %02X %02X %02X %02X %02X %02X %02X %02X "
               "%02X %02X\n",
               pattern_name, tx_buf[0], tx_buf[1], tx_buf[2], tx_buf[3], tx_buf[4], tx_buf[5], tx_buf[6], tx_buf[7],
               tx_buf[8], tx_buf[9], tx_buf[10], tx_buf[11], tx_buf[12], tx_buf[13], tx_buf[14], tx_buf[15]);
    }
#endif

    /* Send the frame as SPI_CHUNK_COUNT separate transactions. Each one re-waits for READY, because
     * the XIAO re-arms its SPI slave between every chunk (spi_slave_queue_trans() only posts to a
     * FreeRTOS queue - the driver's task/ISR context programs the DMA and arms the peripheral some
     * tens of microseconds later, and this loop polls READY at 250MHz, so without the guard delay
     * below the master would start clocking into a slave that isn't listening yet). */
    HAL_StatusTypeDef status = HAL_OK;
#if SPI_TEST_PATTERN
    /* Bisection mode: one small transaction per frame - see SPI_TEST_BYTES. */
    const size_t chunk_bytes = SPI_TEST_BYTES;
    const size_t chunk_count = 1;
#else
    const size_t chunk_bytes = SPI_CHUNK_BYTES;
    const size_t chunk_count = SPI_CHUNK_COUNT;
#endif

    if (!spi_wait_ready(GPIO_PIN_SET)) {
        printf("send_vis_frame_spi: XIAO not ready at frame start (timeout)\n");
        return;
    }

    for (size_t chunk = 0; chunk < chunk_count; chunk++) {
        spi_bridge_delay_us(SPI_READY_TO_CS_DELAY_US);

        HAL_GPIO_WritePin(SPI4_NSS_GPIO_Port, SPI4_NSS_Pin, GPIO_PIN_RESET); /* select (active low) */
        /* CS setup: let the slave's CS-detect logic latch the transaction start before the first
         * SCK edge arrives. */
        spi_bridge_delay_us(SPI_CS_SETUP_DELAY_US);

        status = HAL_SPI_Transmit(&hspi4, tx_buf + chunk * chunk_bytes, (uint16_t)chunk_bytes,
                                  SPI_TRANSFER_TIMEOUT_MS);

        /* CS hold: HAL_SPI_Transmit returns on EOT, but let the last bits settle at the slave before
         * releasing CS so the tail of the chunk isn't truncated by an early deassert. */
        spi_bridge_delay_us(SPI_CS_HOLD_DELAY_US);
        HAL_GPIO_WritePin(SPI4_NSS_GPIO_Port, SPI4_NSS_Pin, GPIO_PIN_SET); /* deselect */

        if (status != HAL_OK) {
            printf("send_vis_frame_spi: HAL_SPI_Transmit failed at chunk %u/%u (status=%d)\n", (unsigned)chunk,
                   (unsigned)chunk_count, (int)status);
            return;
        }

        /* Edge handshake before the next chunk: LOW confirms the slave saw this transaction end,
         * HIGH confirms it has re-armed. Skipped after the final chunk - the slave re-arms during
         * the idle gap before the next frame, which the frame-start wait above covers. */
        if ((chunk + 1) < chunk_count) {
            if (!spi_wait_ready(GPIO_PIN_RESET)) {
                printf("send_vis_frame_spi: READY stuck high after chunk %u/%u\n", (unsigned)chunk,
                       (unsigned)chunk_count);
                return; /* abandon frame; the XIAO resyncs to chunk 0 on its side */
            }
            if (!spi_wait_ready(GPIO_PIN_SET)) {
                printf("send_vis_frame_spi: XIAO did not re-arm after chunk %u/%u\n", (unsigned)chunk,
                       (unsigned)chunk_count);
                return;
            }
        }
    }

    /* Every chunk went out (the loop returns early on any failure, so reaching here means all of
     * them). Rate-limited rather than silent - lets a bare picocom session confirm sends really are
     * happening and at what rate, without flooding the console. Correlate the frame_counter/crc16
     * printed here against what the XIAO logs to tell "STM32 isn't really sending" apart from "it's
     * sending, but the XIAO can't validate it". */
    static uint32_t last_ok_log_ms = 0;
    uint32_t now = HAL_GetTick();
    if ((now - last_ok_log_ms) >= 1000) {
        last_ok_log_ms = now;
        printf("send_vis_frame_spi: sent frame %lu OK (crc=0x%04X, %u chunks x %u bytes)\n",
               (unsigned long)frame_counter, header.crc16, (unsigned)chunk_count, (unsigned)chunk_bytes);
    }
}
#endif /* CONF_STREAM_SPI */
